# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Homebrew extensions
brew 'mas'

# Essentials
brew 'zsh'
brew 'git'
brew 'helix'

# Shell setup
brew 'sheldon'
brew 'starship'
brew 'eza'
brew 'zoxide'
brew 'ellie/atuin/atuin'
brew 'zellij'

# General language tooling
brew 'proto'

# Node setup
brew 'nvm'
brew 'yarn'
brew 'pnpm'

# Python setup
brew 'uv'

# Rust setup
brew 'rustup-init'

# Terraform setup
brew 'hashicorp/tap/terraform'

# JVM setup
brew 'sdkman/tap/sdkman-cli'

# Git tools
brew 'git-lfs'
brew 'git-extras'
brew 'git-secrets'

# CLI tools
brew 'cloc'
brew 'fzf'
brew 'gh'
brew 'wget'
brew 'telnet'
brew 'curl'
brew 'bat'
brew 'ffmpeg'
brew 'fd'
brew 'dbcli/tap/pgcli'
brew 'litecli'
brew 'shellcheck'
brew 'ripgrep'
brew 'hurl'

# Other tools
brew 'cmake'
brew 'make'

# Quicklook
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-mulish'
cask 'font-fira-code'
cask 'font-source-sans-pro'
cask 'font-inter'
cask 'font-figtree'
cask 'font-fira-code-nerd-font'

# Apps
cask 'leader-key'
cask 'homerow'
cask 'visual-studio-code'
cask 'karabiner-elements'
cask 'wezterm'
cask 'orbstack'
cask 'figma'
cask 'slack'
cask 'signal'
cask 'beeper'
cask 'raycast'
cask 'obsidian'
cask 'jordanbaird-ice'
cask 'spotify'
cask 'iina'
cask 'mediahuman-audio-converter'
cask 'monitorcontrol'
cask 'transmission'
cask 'google-chrome'
cask 'linear-linear'
cask 'jetbrains-toolbox'
cask 'notion'
cask 'netnewswire'
cask 'eddie'
cask 'backblaze'
cask 'keka'
cask 'hpedrorodrigues/tools/dockutil'
cask '1password/tap/1password-cli'

# Mac apps
mas "Userscripts", id: 1463298887
mas "Raivo OTP", id: 1498497896
mas "Tailscale", id: 1475387142
mas "Mela Recipe Manager", id: 1568924476
mas "NextDNS", id: 1464122853
mas "1Password for Safari", id: 1569813296
mas "Velja", id: 1607635845
mas "Anybox", id: 1593408455
mas "Hush", id: 1544743900
mas "DaisyDisk", id: 411643860
mas "Amphetamine", id: 937984704
mas "GoodLinks", id: 1474335294
mas "PiPifier", id: 1160374471
