# To obtain this list run `code --list-extensions`
bezbac.concrete-vscode
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
charliermarsh.ruff
csstools.postcss
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
fabiospampinato.vscode-open-in-github
file-icons.file-icons
GitHub.copilot
GitHub.copilot-chat
github.vscode-github-actions
GitHub.vscode-pull-request-github
gregoire.dance
Gruntfuggly.todo-tree
GuodongSun.vscode-git-cruise
hashicorp.hcl
kahole.magit
mathiasfrohlich.Kotlin
mhutchie.git-graph
moonrepo.moon-console
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
naumovs.color-highlight
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
tamasfe.even-better-toml
unifiedjs.vscode-mdx
wayou.vscode-todo-highlight
will-stone.in-any-case