# To obtain this list run `code --list-extensions`

# Default extensions
GitHub.copilot
GitHub.copilot-chat
github.vscode-github-actions
GitHub.vscode-pull-request-github
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer

# Essentials
alefragnani.project-manager
arturodent.command-alias
be5invis.vscode-custom-css
EditorConfig.EditorConfig
kahole.magit
tomrijndorp.find-it-faster

# General extensions
bierner.markdown-preview-github-styles
mk12.better-git-line-blame
naumovs.color-highlight
wayou.vscode-todo-highlight
shardulm94.trailing-spaces

# Utilities
richie5um2.vscode-sort-json
samueltscott.maximizeterminal

# Themes
bezbac.concrete-vscode
davidbwaters.macos-modern-theme

# Python specific
charliermarsh.ruff
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Webdev specific
bradlc.vscode-tailwindcss
csstools.postcss
dbaeumer.vscode-eslint
esbenp.prettier-vscode
moonrepo.moon-console
biomejs.biome
nicoespeon.abracadabra

# Rust specific
rust-lang.rust-analyzer

# Language Support - Astro
astro-build.astro-vscode

# Language Support - hurl
mateuszdrewniak.hurl-runner
jacobpfeifer.pfeifer-hurl

# Language Support - MDX
unifiedjs.vscode-mdx

# Language Support - KDL
kdl-org.kdl

# Language Support - TOML
tamasfe.even-better-toml

# Language Support - HCL
hashicorp.hcl

# Language Support - Terraform
hashicorp.terraform

# Language Support - YAML
redhat.vscode-yaml

# Language Support - vimrc
voidei.vscode-vimrc

# Language Support - json5
blueglassblock.better-json5

# Language Support - Deno
denoland.vscode-deno

# Language Support - Kotlin
mathiasfrohlich.kotlin
