# To obtain this list run `code --list-extensions`
bezbac.concrete-vscode
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
file-icons.file-icons
formulahendry.auto-close-tag
GitHub.vscode-pull-request-github
mhutchie.git-graph
hashicorp.hcl
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
rust-lang.rust-analyzer
wayou.vscode-todo-highlight
